core/testdata/notify-subscription-terminated-soap.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns7:NotifySubscriptionTerminated xmlns:ns2="http://www.siri.org.uk/siri" xmlns:ns3="http://www.ifopt.org.uk/acsb" xmlns:ns4="http://www.ifopt.org.uk/ifopt" xmlns:ns5="http://datex2.eu/schema/2_0RC1/2_0" xmlns:ns6="http://wsdl.siri.org.uk/siri" xmlns:ns7="http://wsdl.siri.org.uk">
      <Notification>
        <ns2:ResponseTimestamp>2020-01-30T10:00:00Z</ns2:ResponseTimestamp>
        <ns2:ProducerRef>RELAIS</ns2:ProducerRef>
        <ns2:Address>test-address</ns2:Address>
        <ns2:ResponseMessageIdentifier>RELAIS:ResponseMessage::b3814ad3-d282-40ba-8895-68226045feb7:LOC</ns2:ResponseMessageIdentifier>
        <ns2:RequestMessageRef>STIF:Message::811125622:LOC</ns2:RequestMessageRef>
        <ns2:SubscriptionRef>6ba7b814-9dad-11d1-0-00c04fd430c8</ns2:SubscriptionRef>
        <ns2:SubscriberRef>STIF</ns2:SubscriberRef>
      </Notification>
    </ns7:NotifySubscriptionTerminated>
  </soap:Body>
</soap:Envelope>