core/testdata/stopmonitoringdeliveries-request-soap.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns6:NotifyStopMonitoring xmlns:ns2="http://www.siri.org.uk/siri"
    xmlns:ns3="http://www.ifopt.org.uk/acsb"
    xmlns:ns4="http://www.ifopt.org.uk/ifopt"
    xmlns:ns5="http://datex2.eu/schema/2_0RC1/2_0"
    xmlns:ns6="http://wsdl.siri.org.uk"
    xmlns:ns7="http://wsdl.siri.org.uk/siri">
      <ServiceDeliveryInfo>
        <ns2:ResponseTimestamp>
        2017-05-15T13:26:12.798+02:00</ns2:ResponseTimestamp>
        <ns2:ProducerRef>SNCF-ACCES</ns2:ProducerRef>
        <ns2:ResponseMessageIdentifier>
        SNCF-ACCES:ResponseMessage::357cb6e2-7778-4c5f-b727-45715d47940e:LOC</ns2:ResponseMessageIdentifier>
        <ns2:RequestMessageRef>
        SNCF-ACCES:Message::ebff20ed-021c-4805-8b1a-3b507555b785:LOC</ns2:RequestMessageRef>
      </ServiceDeliveryInfo>
      <Notification>
        <ns2:StopMonitoringDelivery version="2.0:FR-IDF-2.4">
          <ns2:ResponseTimestamp>
          2017-05-15T13:26:12.798+02:00</ns2:ResponseTimestamp>
          <ns2:RequestMessageRef>
          SNCF-ACCES:Message::ebff20ed-021c-4805-8b1a-3b507555b785:LOC</ns2:RequestMessageRef>
          <ns2:SubscriberRef>RELAIS</ns2:SubscriberRef>
          <ns2:SubscriptionRef>
          RELAIS:Subscription::64479:LOC</ns2:SubscriptionRef>
          <ns2:Status>true</ns2:Status>
          <ns2:MonitoredStopVisit>
            <ns2:RecordedAtTime>
            2017-05-15T13:26:10.116+02:00</ns2:RecordedAtTime>
            <ns2:ItemIdentifier>
            SNCF-ACCES:Item::411415_125212:LOC</ns2:ItemIdentifier>
            <ns2:MonitoringRef>
            STIF:StopPoint:Q:411415:</ns2:MonitoringRef>
            <ns2:MonitoredVehicleJourney>
              <ns2:LineRef>STIF:Line::C01737:</ns2:LineRef>
              <ns2:FramedVehicleJourneyRef>
                <ns2:DataFrameRef>any</ns2:DataFrameRef>
                <ns2:DatedVehicleJourneyRef>
                SNCF-ACCES:VehicleJourney::125212_20170515:LOC</ns2:DatedVehicleJourneyRef>
              </ns2:FramedVehicleJourneyRef>
              <ns2:JourneyPatternRef>
              SNCF-ACCES:JourneyPattern::AOSA:LOC</ns2:JourneyPatternRef>
              <ns2:JourneyPatternName>AOSA</ns2:JourneyPatternName>
              <ns2:VehicleMode>rail</ns2:VehicleMode>
              <ns2:PublishedLineName>H</ns2:PublishedLineName>
              <ns2:OperatorRef>
              SNCF-ACCES:Operator::SNCF:</ns2:OperatorRef>
              <ns2:VehicleFeatureRef>
              longTrain</ns2:VehicleFeatureRef>
              <ns2:DestinationRef>
              STIF:StopPoint:Q:41071:</ns2:DestinationRef>
              <ns2:DestinationName>GARE DU NORD
              SURFACE</ns2:DestinationName>
              <ns2:Monitored>true</ns2:Monitored>
              <ns2:TrainNumbers>
                <ns2:TrainNumberRef>125212</ns2:TrainNumberRef>
              </ns2:TrainNumbers>
              <ns2:JourneyParts>
                <ns2:JourneyPartInfo>
                  <ns2:JourneyPartRef>125212</ns2:JourneyPartRef>
                  <ns2:TrainNumberRef>125212:2</ns2:TrainNumberRef>
                </ns2:JourneyPartInfo>
              </ns2:JourneyParts>
              <ns2:MonitoredCall>
                <ns2:StopPointRef>
                STIF:StopPoint:Q:411415:</ns2:StopPointRef>
                <ns2:Order>1</ns2:Order>
                <ns2:StopPointName>GARE D'EPINAY
                VILLETANEUSE</ns2:StopPointName>
                <ns2:VehicleAtStop>false</ns2:VehicleAtStop>
                <ns2:PlatformTraversal>
                false</ns2:PlatformTraversal>
                <ns2:DestinationDisplay>GARE DU NORD
                SURFACE</ns2:DestinationDisplay>
                <ns2:AimedArrivalTime>
                2017-05-15T13:29:00.000+02:00</ns2:AimedArrivalTime>
                <ns2:ExpectedArrivalTime>
                2017-05-15T13:29:00.000+02:00</ns2:ExpectedArrivalTime>
                <ns2:ArrivalStatus>onTime</ns2:ArrivalStatus>
                <ns2:ArrivalProximityText>A
                l'approche</ns2:ArrivalProximityText>
                <ns2:ArrivalPlatformName>
                4</ns2:ArrivalPlatformName>
                <ns2:AimedDepartureTime>
                2017-05-15T13:29:00.000+02:00</ns2:AimedDepartureTime>
                <ns2:ExpectedDepartureTime>
                2017-05-15T13:29:00.000+02:00</ns2:ExpectedDepartureTime>
                <ns2:DepartureStatus>onTime</ns2:DepartureStatus>
                <ns2:DeparturePlatformName>
                4</ns2:DeparturePlatformName>
                <ns2:DepartureBoardingActivity>
                boarding</ns2:DepartureBoardingActivity>
              </ns2:MonitoredCall>
            </ns2:MonitoredVehicleJourney>
          </ns2:MonitoredStopVisit>
        </ns2:StopMonitoringDelivery>
      </Notification>
      <SiriExtension />
    </ns6:NotifyStopMonitoring>
  </soap:Body>
</soap:Envelope>
